{
	"weightsManifest": [{
			"paths": ["group1-shard1of1"],
			"weights": [{
					"name": "batch_normalization_1/gamma",
					"dtype": "float32",
					"shape": [1]
				}, {
					"name": "batch_normalization_1/beta",
					"dtype": "float32",
					"shape": [1]
				}, {
					"name": "batch_normalization_1/moving_mean",
					"dtype": "float32",
					"shape": [1]
				}, {
					"name": "batch_normalization_1/moving_variance",
					"dtype": "float32",
					"shape": [1]
				}
			]
		}, {
			"paths": ["group2-shard1of1"],
			"weights": [{
					"name": "batch_normalization_10/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_10/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_10/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_10/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group3-shard1of1"],
			"weights": [{
					"name": "batch_normalization_100/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_100/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_100/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_100/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group4-shard1of1"],
			"weights": [{
					"name": "batch_normalization_101/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_101/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_101/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_101/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group5-shard1of1"],
			"weights": [{
					"name": "batch_normalization_102/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_102/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_102/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_102/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group6-shard1of1"],
			"weights": [{
					"name": "batch_normalization_103/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_103/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_103/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_103/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group7-shard1of1"],
			"weights": [{
					"name": "batch_normalization_104/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_104/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_104/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_104/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group8-shard1of1"],
			"weights": [{
					"name": "batch_normalization_105/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_105/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_105/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_105/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group9-shard1of1"],
			"weights": [{
					"name": "batch_normalization_106/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_106/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_106/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_106/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group10-shard1of1"],
			"weights": [{
					"name": "batch_normalization_107/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_107/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_107/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_107/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group11-shard1of1"],
			"weights": [{
					"name": "batch_normalization_108/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_108/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_108/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_108/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group12-shard1of1"],
			"weights": [{
					"name": "batch_normalization_109/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_109/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_109/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_109/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group13-shard1of1"],
			"weights": [{
					"name": "batch_normalization_11/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_11/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_11/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_11/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group14-shard1of1"],
			"weights": [{
					"name": "batch_normalization_110/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_110/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_110/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_110/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group15-shard1of1"],
			"weights": [{
					"name": "batch_normalization_111/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_111/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_111/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_111/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group16-shard1of1"],
			"weights": [{
					"name": "batch_normalization_112/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_112/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_112/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_112/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group17-shard1of1"],
			"weights": [{
					"name": "batch_normalization_113/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_113/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_113/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_113/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group18-shard1of1"],
			"weights": [{
					"name": "batch_normalization_114/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_114/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_114/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_114/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group19-shard1of1"],
			"weights": [{
					"name": "batch_normalization_115/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_115/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_115/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_115/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group20-shard1of1"],
			"weights": [{
					"name": "batch_normalization_116/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_116/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_116/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_116/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group21-shard1of1"],
			"weights": [{
					"name": "batch_normalization_117/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_117/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_117/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_117/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group22-shard1of1"],
			"weights": [{
					"name": "batch_normalization_118/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_118/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_118/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_118/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group23-shard1of1"],
			"weights": [{
					"name": "batch_normalization_119/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_119/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_119/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_119/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group24-shard1of1"],
			"weights": [{
					"name": "batch_normalization_12/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_12/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_12/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_12/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group25-shard1of1"],
			"weights": [{
					"name": "batch_normalization_120/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_120/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_120/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_120/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group26-shard1of1"],
			"weights": [{
					"name": "batch_normalization_121/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_121/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_121/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_121/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group27-shard1of1"],
			"weights": [{
					"name": "batch_normalization_122/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_122/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_122/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_122/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group28-shard1of1"],
			"weights": [{
					"name": "batch_normalization_123/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_123/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_123/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_123/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group29-shard1of1"],
			"weights": [{
					"name": "batch_normalization_124/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_124/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_124/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_124/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group30-shard1of1"],
			"weights": [{
					"name": "batch_normalization_125/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_125/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_125/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_125/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group31-shard1of1"],
			"weights": [{
					"name": "batch_normalization_126/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_126/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_126/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_126/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group32-shard1of1"],
			"weights": [{
					"name": "batch_normalization_127/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_127/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_127/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_127/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group33-shard1of1"],
			"weights": [{
					"name": "batch_normalization_128/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_128/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_128/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_128/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group34-shard1of1"],
			"weights": [{
					"name": "batch_normalization_129/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_129/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_129/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_129/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group35-shard1of1"],
			"weights": [{
					"name": "batch_normalization_13/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_13/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_13/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_13/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group36-shard1of1"],
			"weights": [{
					"name": "batch_normalization_130/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_130/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_130/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_130/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group37-shard1of1"],
			"weights": [{
					"name": "batch_normalization_131/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_131/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_131/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_131/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group38-shard1of1"],
			"weights": [{
					"name": "batch_normalization_132/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_132/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_132/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_132/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group39-shard1of1"],
			"weights": [{
					"name": "batch_normalization_133/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_133/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_133/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_133/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group40-shard1of1"],
			"weights": [{
					"name": "batch_normalization_134/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_134/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_134/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_134/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group41-shard1of1"],
			"weights": [{
					"name": "batch_normalization_135/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_135/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_135/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_135/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group42-shard1of1"],
			"weights": [{
					"name": "batch_normalization_136/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_136/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_136/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_136/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group43-shard1of1"],
			"weights": [{
					"name": "batch_normalization_137/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_137/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_137/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_137/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group44-shard1of1"],
			"weights": [{
					"name": "batch_normalization_138/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_138/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_138/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_138/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group45-shard1of1"],
			"weights": [{
					"name": "batch_normalization_139/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_139/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_139/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_139/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group46-shard1of1"],
			"weights": [{
					"name": "batch_normalization_14/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_14/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_14/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_14/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group47-shard1of1"],
			"weights": [{
					"name": "batch_normalization_140/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_140/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_140/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_140/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group48-shard1of1"],
			"weights": [{
					"name": "batch_normalization_141/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_141/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_141/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_141/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group49-shard1of1"],
			"weights": [{
					"name": "batch_normalization_142/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_142/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_142/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_142/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group50-shard1of1"],
			"weights": [{
					"name": "batch_normalization_143/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_143/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_143/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_143/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group51-shard1of1"],
			"weights": [{
					"name": "batch_normalization_144/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_144/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_144/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_144/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group52-shard1of1"],
			"weights": [{
					"name": "batch_normalization_145/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_145/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_145/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_145/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group53-shard1of1"],
			"weights": [{
					"name": "batch_normalization_146/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_146/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_146/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_146/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group54-shard1of1"],
			"weights": [{
					"name": "batch_normalization_147/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_147/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_147/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_147/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group55-shard1of1"],
			"weights": [{
					"name": "batch_normalization_148/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_148/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_148/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_148/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group56-shard1of1"],
			"weights": [{
					"name": "batch_normalization_149/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_149/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_149/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_149/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group57-shard1of1"],
			"weights": [{
					"name": "batch_normalization_15/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_15/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_15/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_15/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group58-shard1of1"],
			"weights": [{
					"name": "batch_normalization_150/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_150/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_150/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_150/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group59-shard1of1"],
			"weights": [{
					"name": "batch_normalization_151/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_151/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_151/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_151/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group60-shard1of1"],
			"weights": [{
					"name": "batch_normalization_152/gamma",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_152/beta",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_152/moving_mean",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_152/moving_variance",
					"dtype": "float32",
					"shape": [4]
				}
			]
		}, {
			"paths": ["group61-shard1of1"],
			"weights": [{
					"name": "batch_normalization_153/gamma",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_153/beta",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_153/moving_mean",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_153/moving_variance",
					"dtype": "float32",
					"shape": [4]
				}
			]
		}, {
			"paths": ["group62-shard1of1"],
			"weights": [{
					"name": "batch_normalization_154/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_154/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_154/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_154/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group63-shard1of1"],
			"weights": [{
					"name": "batch_normalization_155/gamma",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_155/beta",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_155/moving_mean",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_155/moving_variance",
					"dtype": "float32",
					"shape": [4]
				}
			]
		}, {
			"paths": ["group64-shard1of1"],
			"weights": [{
					"name": "batch_normalization_156/gamma",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_156/beta",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_156/moving_mean",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_156/moving_variance",
					"dtype": "float32",
					"shape": [4]
				}
			]
		}, {
			"paths": ["group65-shard1of1"],
			"weights": [{
					"name": "batch_normalization_157/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_157/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_157/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_157/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group66-shard1of1"],
			"weights": [{
					"name": "batch_normalization_158/gamma",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_158/beta",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_158/moving_mean",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_158/moving_variance",
					"dtype": "float32",
					"shape": [4]
				}
			]
		}, {
			"paths": ["group67-shard1of1"],
			"weights": [{
					"name": "batch_normalization_159/gamma",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_159/beta",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_159/moving_mean",
					"dtype": "float32",
					"shape": [4]
				}, {
					"name": "batch_normalization_159/moving_variance",
					"dtype": "float32",
					"shape": [4]
				}
			]
		}, {
			"paths": ["group68-shard1of1"],
			"weights": [{
					"name": "batch_normalization_16/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_16/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_16/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_16/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group69-shard1of1"],
			"weights": [{
					"name": "batch_normalization_17/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_17/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_17/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_17/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group70-shard1of1"],
			"weights": [{
					"name": "batch_normalization_18/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_18/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_18/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_18/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group71-shard1of1"],
			"weights": [{
					"name": "batch_normalization_19/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_19/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_19/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_19/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group72-shard1of1"],
			"weights": [{
					"name": "batch_normalization_2/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_2/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_2/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_2/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group73-shard1of1"],
			"weights": [{
					"name": "batch_normalization_20/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_20/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_20/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_20/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group74-shard1of1"],
			"weights": [{
					"name": "batch_normalization_21/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_21/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_21/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_21/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group75-shard1of1"],
			"weights": [{
					"name": "batch_normalization_22/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_22/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_22/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_22/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group76-shard1of1"],
			"weights": [{
					"name": "batch_normalization_23/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_23/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_23/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_23/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group77-shard1of1"],
			"weights": [{
					"name": "batch_normalization_24/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_24/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_24/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_24/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group78-shard1of1"],
			"weights": [{
					"name": "batch_normalization_25/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_25/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_25/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_25/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group79-shard1of1"],
			"weights": [{
					"name": "batch_normalization_26/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_26/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_26/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_26/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group80-shard1of1"],
			"weights": [{
					"name": "batch_normalization_27/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_27/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_27/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_27/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group81-shard1of1"],
			"weights": [{
					"name": "batch_normalization_28/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_28/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_28/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_28/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group82-shard1of1"],
			"weights": [{
					"name": "batch_normalization_29/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_29/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_29/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_29/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group83-shard1of1"],
			"weights": [{
					"name": "batch_normalization_3/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_3/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_3/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_3/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group84-shard1of1"],
			"weights": [{
					"name": "batch_normalization_30/gamma",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_30/beta",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_30/moving_mean",
					"dtype": "float32",
					"shape": [16]
				}, {
					"name": "batch_normalization_30/moving_variance",
					"dtype": "float32",
					"shape": [16]
				}
			]
		}, {
			"paths": ["group85-shard1of1"],
			"weights": [{
					"name": "batch_normalization_31/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_31/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_31/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_31/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group86-shard1of1"],
			"weights": [{
					"name": "batch_normalization_32/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_32/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_32/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_32/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group87-shard1of1"],
			"weights": [{
					"name": "batch_normalization_33/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_33/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_33/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_33/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group88-shard1of1"],
			"weights": [{
					"name": "batch_normalization_34/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_34/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_34/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_34/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group89-shard1of1"],
			"weights": [{
					"name": "batch_normalization_35/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_35/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_35/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_35/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group90-shard1of1"],
			"weights": [{
					"name": "batch_normalization_36/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_36/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_36/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_36/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group91-shard1of1"],
			"weights": [{
					"name": "batch_normalization_37/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_37/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_37/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_37/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group92-shard1of1"],
			"weights": [{
					"name": "batch_normalization_38/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_38/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_38/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_38/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group93-shard1of1"],
			"weights": [{
					"name": "batch_normalization_39/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_39/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_39/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_39/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group94-shard1of1"],
			"weights": [{
					"name": "batch_normalization_4/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_4/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_4/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_4/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group95-shard1of1"],
			"weights": [{
					"name": "batch_normalization_40/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_40/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_40/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_40/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group96-shard1of1"],
			"weights": [{
					"name": "batch_normalization_41/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_41/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_41/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_41/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group97-shard1of1"],
			"weights": [{
					"name": "batch_normalization_42/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_42/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_42/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_42/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group98-shard1of1"],
			"weights": [{
					"name": "batch_normalization_43/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_43/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_43/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_43/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group99-shard1of1"],
			"weights": [{
					"name": "batch_normalization_44/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_44/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_44/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_44/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group100-shard1of1"],
			"weights": [{
					"name": "batch_normalization_45/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_45/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_45/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_45/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group101-shard1of1"],
			"weights": [{
					"name": "batch_normalization_46/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_46/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_46/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_46/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group102-shard1of1"],
			"weights": [{
					"name": "batch_normalization_47/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_47/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_47/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_47/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group103-shard1of1"],
			"weights": [{
					"name": "batch_normalization_48/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_48/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_48/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_48/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group104-shard1of1"],
			"weights": [{
					"name": "batch_normalization_49/gamma",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_49/beta",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_49/moving_mean",
					"dtype": "float32",
					"shape": [128]
				}, {
					"name": "batch_normalization_49/moving_variance",
					"dtype": "float32",
					"shape": [128]
				}
			]
		}, {
			"paths": ["group105-shard1of1"],
			"weights": [{
					"name": "batch_normalization_5/gamma",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_5/beta",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_5/moving_mean",
					"dtype": "float32",
					"shape": [8]
				}, {
					"name": "batch_normalization_5/moving_variance",
					"dtype": "float32",
					"shape": [8]
				}
			]
		}, {
			"paths": ["group106-shard1of1"],
			"weights": [{
					"name": "batch_normalization_50/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_50/beta",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_50/moving_mean",
					"dtype": "float32",
					"shape": [32]
				}, {
					"name": "batch_normalization_50/moving_variance",
					"dtype": "float32",
					"shape": [32]
				}
			]
		}, {
			"paths": ["group107-shard1of1"],
			"weights": [{
					"name": "batch_normalization_51/gamma",
					"dtype": "float32",
					"shape": [32]
				}, {
